#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.kubernetes_manifest.argocd_init_password will be created
  + resource "kubernetes_manifest" "argocd_init_password" {
      + computed_fields = [
          + "status",
        ]
      + manifest        = {
          + apiVersion = "batch/v1"
          + kind       = "Job"
          + metadata   = {
              + name      = "argocd-init-admin-password"
              + namespace = "argocd"
            }
          + spec       = {
              + template                = {
                  + spec = {
                      + containers         = [
                          + {
                              + command      = [
                                  + "sh",
                                  + "-c",
                                  + <<-EOT
                                        #!/bin/sh
                                        set -e
                                        
                                        # bcrypt 설치
                                        pip install bcrypt --quiet
                                        
                                        # argocd-secrets에서 평문 비밀번호 읽기
                                        PASSWORD=$(cat /mnt/argocd-secrets/admin.password)
                                        
                                        # bcrypt 해시 생성
                                        HASHED=$(python3 -c "import bcrypt; print(bcrypt.hashpw('$PASSWORD'.encode(), bcrypt.gensalt(rounds=10)).decode())")
                                        
                                        # base64 인코딩
                                        HASHED_B64=$(echo -n "$HASHED" | base64 -w0)
                                        
                                        # kubectl 설치
                                        apt-get update && apt-get install -y curl --quiet
                                        curl -LO "https://dl.k8s.io/release/$(curl -L -s https://dl.k8s.io/release/stable.txt)/bin/linux/amd64/kubectl"
                                        chmod +x kubectl
                                        mv kubectl /usr/local/bin/
                                        
                                        # 기존 server.secretkey 확인 (있으면 보존, 없으면 생성)
                                        EXISTING_KEY=$(kubectl get secret argocd-secret -n argocd -o jsonpath='{.data.server\.secretkey}' 2>/dev/null || echo "")
                                        
                                        if [ -z "$EXISTING_KEY" ]; then
                                          echo "server.secretkey not found, generating new one"
                                          apt-get install -y openssl --quiet
                                          SERVER_KEY=$(openssl rand -base64 32)
                                          SERVER_KEY_B64=$(echo -n "$SERVER_KEY" | base64 -w0)
                                        else
                                          echo "Preserving existing server.secretkey"
                                          SERVER_KEY_B64="$EXISTING_KEY"
                                        fi
                                        
                                        # Kubernetes API를 통해 argocd-secret 패치 (merge로 기존 데이터 보존)
                                        cat <<EOF > /tmp/patch.json
                                        {
                                          "data": {
                                            "admin.password": "$HASHED_B64",
                                            "admin.passwordMtime": "$(date -u +%Y-%m-%dT%H:%M:%SZ | base64 -w0)",
                                            "server.secretkey": "$SERVER_KEY_B64"
                                          }
                                        }
                                        EOF
                                        
                                        # Secret 패치
                                        kubectl patch secret argocd-secret -n argocd --type=merge --patch-file=/tmp/patch.json
                                        
                                        echo "Admin password initialized successfully"
                                    EOT,
                                ]
                              + image        = "python:3.11-slim"
                              + name         = "init-password"
                              + volumeMounts = [
                                  + {
                                      + mountPath = "/mnt/argocd-secrets"
                                      + name      = "argocd-secrets"
                                      + readOnly  = true
                                    },
                                ]
                            },
                        ]
                      + restartPolicy      = "Never"
                      + serviceAccountName = "argocd-init-password"
                      + volumes            = [
                          + {
                              + name   = "argocd-secrets"
                              + secret = {
                                  + secretName = "argocd-secrets"
                                }
                            },
                        ]
                    }
                }
              + ttlSecondsAfterFinished = 3600
            }
        }
      + object          = {
          + apiVersion = "batch/v1"
          + kind       = "Job"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-init-admin-password"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + activeDeadlineSeconds   = (known after apply)
              + backoffLimit            = (known after apply)
              + backoffLimitPerIndex    = (known after apply)
              + completionMode          = (known after apply)
              + completions             = (known after apply)
              + managedBy               = (known after apply)
              + manualSelector          = (known after apply)
              + maxFailedIndexes        = (known after apply)
              + parallelism             = (known after apply)
              + podFailurePolicy        = {
                  + rules = (known after apply)
                }
              + podReplacementPolicy    = (known after apply)
              + selector                = {
                  + matchExpressions = (known after apply)
                  + matchLabels      = (known after apply)
                }
              + successPolicy           = {
                  + rules = (known after apply)
                }
              + suspend                 = (known after apply)
              + template                = {
                  + metadata = {
                      + annotations                = (known after apply)
                      + creationTimestamp          = (known after apply)
                      + deletionGracePeriodSeconds = (known after apply)
                      + deletionTimestamp          = (known after apply)
                      + finalizers                 = (known after apply)
                      + generateName               = (known after apply)
                      + generation                 = (known after apply)
                      + labels                     = (known after apply)
                      + managedFields              = (known after apply)
                      + name                       = (known after apply)
                      + namespace                  = (known after apply)
                      + ownerReferences            = (known after apply)
                      + resourceVersion            = (known after apply)
                      + selfLink                   = (known after apply)
                      + uid                        = (known after apply)
                    }
                  + spec     = {
                      + activeDeadlineSeconds         = (known after apply)
                      + affinity                      = {
                          + nodeAffinity    = {
                              + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                              + requiredDuringSchedulingIgnoredDuringExecution  = {
                                  + nodeSelectorTerms = (known after apply)
                                }
                            }
                          + podAffinity     = {
                              + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                              + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                          + podAntiAffinity = {
                              + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                              + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                        }
                      + automountServiceAccountToken  = (known after apply)
                      + containers                    = [
                          + {
                              + args                     = (known after apply)
                              + command                  = [
                                  + "sh",
                                  + "-c",
                                  + <<-EOT
                                        #!/bin/sh
                                        set -e
                                        
                                        # bcrypt 설치
                                        pip install bcrypt --quiet
                                        
                                        # argocd-secrets에서 평문 비밀번호 읽기
                                        PASSWORD=$(cat /mnt/argocd-secrets/admin.password)
                                        
                                        # bcrypt 해시 생성
                                        HASHED=$(python3 -c "import bcrypt; print(bcrypt.hashpw('$PASSWORD'.encode(), bcrypt.gensalt(rounds=10)).decode())")
                                        
                                        # base64 인코딩
                                        HASHED_B64=$(echo -n "$HASHED" | base64 -w0)
                                        
                                        # kubectl 설치
                                        apt-get update && apt-get install -y curl --quiet
                                        curl -LO "https://dl.k8s.io/release/$(curl -L -s https://dl.k8s.io/release/stable.txt)/bin/linux/amd64/kubectl"
                                        chmod +x kubectl
                                        mv kubectl /usr/local/bin/
                                        
                                        # 기존 server.secretkey 확인 (있으면 보존, 없으면 생성)
                                        EXISTING_KEY=$(kubectl get secret argocd-secret -n argocd -o jsonpath='{.data.server\.secretkey}' 2>/dev/null || echo "")
                                        
                                        if [ -z "$EXISTING_KEY" ]; then
                                          echo "server.secretkey not found, generating new one"
                                          apt-get install -y openssl --quiet
                                          SERVER_KEY=$(openssl rand -base64 32)
                                          SERVER_KEY_B64=$(echo -n "$SERVER_KEY" | base64 -w0)
                                        else
                                          echo "Preserving existing server.secretkey"
                                          SERVER_KEY_B64="$EXISTING_KEY"
                                        fi
                                        
                                        # Kubernetes API를 통해 argocd-secret 패치 (merge로 기존 데이터 보존)
                                        cat <<EOF > /tmp/patch.json
                                        {
                                          "data": {
                                            "admin.password": "$HASHED_B64",
                                            "admin.passwordMtime": "$(date -u +%Y-%m-%dT%H:%M:%SZ | base64 -w0)",
                                            "server.secretkey": "$SERVER_KEY_B64"
                                          }
                                        }
                                        EOF
                                        
                                        # Secret 패치
                                        kubectl patch secret argocd-secret -n argocd --type=merge --patch-file=/tmp/patch.json
                                        
                                        echo "Admin password initialized successfully"
                                    EOT,
                                ]
                              + env                      = (known after apply)
                              + envFrom                  = (known after apply)
                              + image                    = "python:3.11-slim"
                              + imagePullPolicy          = (known after apply)
                              + lifecycle                = {
                                  + postStart  = {
                                      + exec      = {
                                          + command = (known after apply)
                                        }
                                      + httpGet   = {
                                          + host        = (known after apply)
                                          + httpHeaders = (known after apply)
                                          + path        = (known after apply)
                                          + port        = (known after apply)
                                          + scheme      = (known after apply)
                                        }
                                      + sleep     = {
                                          + seconds = (known after apply)
                                        }
                                      + tcpSocket = {
                                          + host = (known after apply)
                                          + port = (known after apply)
                                        }
                                    }
                                  + preStop    = {
                                      + exec      = {
                                          + command = (known after apply)
                                        }
                                      + httpGet   = {
                                          + host        = (known after apply)
                                          + httpHeaders = (known after apply)
                                          + path        = (known after apply)
                                          + port        = (known after apply)
                                          + scheme      = (known after apply)
                                        }
                                      + sleep     = {
                                          + seconds = (known after apply)
                                        }
                                      + tcpSocket = {
                                          + host = (known after apply)
                                          + port = (known after apply)
                                        }
                                    }
                                  + stopSignal = (known after apply)
                                }
                              + livenessProbe            = {
                                  + exec                          = {
                                      + command = (known after apply)
                                    }
                                  + failureThreshold              = (known after apply)
                                  + grpc                          = {
                                      + port    = (known after apply)
                                      + service = (known after apply)
                                    }
                                  + httpGet                       = {
                                      + host        = (known after apply)
                                      + httpHeaders = (known after apply)
                                      + path        = (known after apply)
                                      + port        = (known after apply)
                                      + scheme      = (known after apply)
                                    }
                                  + initialDelaySeconds           = (known after apply)
                                  + periodSeconds                 = (known after apply)
                                  + successThreshold              = (known after apply)
                                  + tcpSocket                     = {
                                      + host = (known after apply)
                                      + port = (known after apply)
                                    }
                                  + terminationGracePeriodSeconds = (known after apply)
                                  + timeoutSeconds                = (known after apply)
                                }
                              + name                     = "init-password"
                              + ports                    = (known after apply)
                              + readinessProbe           = {
                                  + exec                          = {
                                      + command = (known after apply)
                                    }
                                  + failureThreshold              = (known after apply)
                                  + grpc                          = {
                                      + port    = (known after apply)
                                      + service = (known after apply)
                                    }
                                  + httpGet                       = {
                                      + host        = (known after apply)
                                      + httpHeaders = (known after apply)
                                      + path        = (known after apply)
                                      + port        = (known after apply)
                                      + scheme      = (known after apply)
                                    }
                                  + initialDelaySeconds           = (known after apply)
                                  + periodSeconds                 = (known after apply)
                                  + successThreshold              = (known after apply)
                                  + tcpSocket                     = {
                                      + host = (known after apply)
                                      + port = (known after apply)
                                    }
                                  + terminationGracePeriodSeconds = (known after apply)
                                  + timeoutSeconds                = (known after apply)
                                }
                              + resizePolicy             = (known after apply)
                              + resources                = {
                                  + claims   = (known after apply)
                                  + limits   = (known after apply)
                                  + requests = (known after apply)
                                }
                              + restartPolicy            = (known after apply)
                              + securityContext          = {
                                  + allowPrivilegeEscalation = (known after apply)
                                  + appArmorProfile          = {
                                      + localhostProfile = (known after apply)
                                      + type             = (known after apply)
                                    }
                                  + capabilities             = {
                                      + add  = (known after apply)
                                      + drop = (known after apply)
                                    }
                                  + privileged               = (known after apply)
                                  + procMount                = (known after apply)
                                  + readOnlyRootFilesystem   = (known after apply)
                                  + runAsGroup               = (known after apply)
                                  + runAsNonRoot             = (known after apply)
                                  + runAsUser                = (known after apply)
                                  + seLinuxOptions           = {
                                      + level = (known after apply)
                                      + role  = (known after apply)
                                      + type  = (known after apply)
                                      + user  = (known after apply)
                                    }
                                  + seccompProfile           = {
                                      + localhostProfile = (known after apply)
                                      + type             = (known after apply)
                                    }
                                  + windowsOptions           = {
                                      + gmsaCredentialSpec     = (known after apply)
                                      + gmsaCredentialSpecName = (known after apply)
                                      + hostProcess            = (known after apply)
                                      + runAsUserName          = (known after apply)
                                    }
                                }
                              + startupProbe             = {
                                  + exec                          = {
                                      + command = (known after apply)
                                    }
                                  + failureThreshold              = (known after apply)
                                  + grpc                          = {
                                      + port    = (known after apply)
                                      + service = (known after apply)
                                    }
                                  + httpGet                       = {
                                      + host        = (known after apply)
                                      + httpHeaders = (known after apply)
                                      + path        = (known after apply)
                                      + port        = (known after apply)
                                      + scheme      = (known after apply)
                                    }
                                  + initialDelaySeconds           = (known after apply)
                                  + periodSeconds                 = (known after apply)
                                  + successThreshold              = (known after apply)
                                  + tcpSocket                     = {
                                      + host = (known after apply)
                                      + port = (known after apply)
                                    }
                                  + terminationGracePeriodSeconds = (known after apply)
                                  + timeoutSeconds                = (known after apply)
                                }
                              + stdin                    = (known after apply)
                              + stdinOnce                = (known after apply)
                              + terminationMessagePath   = (known after apply)
                              + terminationMessagePolicy = (known after apply)
                              + tty                      = (known after apply)
                              + volumeDevices            = (known after apply)
                              + volumeMounts             = [
                                  + {
                                      + mountPath         = "/mnt/argocd-secrets"
                                      + mountPropagation  = (known after apply)
                                      + name              = "argocd-secrets"
                                      + readOnly          = true
                                      + recursiveReadOnly = (known after apply)
                                      + subPath           = (known after apply)
                                      + subPathExpr       = (known after apply)
                                    },
                                ]
                              + workingDir               = (known after apply)
                            },
                        ]
                      + dnsConfig                     = {
                          + nameservers = (known after apply)
                          + options     = (known after apply)
                          + searches    = (known after apply)
                        }
                      + dnsPolicy                     = (known after apply)
                      + enableServiceLinks            = (known after apply)
                      + ephemeralContainers           = (known after apply)
                      + hostAliases                   = (known after apply)
                      + hostIPC                       = (known after apply)
                      + hostNetwork                   = (known after apply)
                      + hostPID                       = (known after apply)
                      + hostUsers                     = (known after apply)
                      + hostname                      = (known after apply)
                      + imagePullSecrets              = (known after apply)
                      + initContainers                = (known after apply)
                      + nodeName                      = (known after apply)
                      + nodeSelector                  = (known after apply)
                      + os                            = {
                          + name = (known after apply)
                        }
                      + overhead                      = (known after apply)
                      + preemptionPolicy              = (known after apply)
                      + priority                      = (known after apply)
                      + priorityClassName             = (known after apply)
                      + readinessGates                = (known after apply)
                      + resourceClaims                = (known after apply)
                      + resources                     = {
                          + claims   = (known after apply)
                          + limits   = (known after apply)
                          + requests = (known after apply)
                        }
                      + restartPolicy                 = "Never"
                      + runtimeClassName              = (known after apply)
                      + schedulerName                 = (known after apply)
                      + schedulingGates               = (known after apply)
                      + securityContext               = {
                          + appArmorProfile          = {
                              + localhostProfile = (known after apply)
                              + type             = (known after apply)
                            }
                          + fsGroup                  = (known after apply)
                          + fsGroupChangePolicy      = (known after apply)
                          + runAsGroup               = (known after apply)
                          + runAsNonRoot             = (known after apply)
                          + runAsUser                = (known after apply)
                          + seLinuxChangePolicy      = (known after apply)
                          + seLinuxOptions           = {
                              + level = (known after apply)
                              + role  = (known after apply)
                              + type  = (known after apply)
                              + user  = (known after apply)
                            }
                          + seccompProfile           = {
                              + localhostProfile = (known after apply)
                              + type             = (known after apply)
                            }
                          + supplementalGroups       = (known after apply)
                          + supplementalGroupsPolicy = (known after apply)
                          + sysctls                  = (known after apply)
                          + windowsOptions           = {
                              + gmsaCredentialSpec     = (known after apply)
                              + gmsaCredentialSpecName = (known after apply)
                              + hostProcess            = (known after apply)
                              + runAsUserName          = (known after apply)
                            }
                        }
                      + serviceAccount                = (known after apply)
                      + serviceAccountName            = "argocd-init-password"
                      + setHostnameAsFQDN             = (known after apply)
                      + shareProcessNamespace         = (known after apply)
                      + subdomain                     = (known after apply)
                      + terminationGracePeriodSeconds = (known after apply)
                      + tolerations                   = (known after apply)
                      + topologySpreadConstraints     = (known after apply)
                      + volumes                       = [
                          + {
                              + awsElasticBlockStore  = {
                                  + fsType    = (known after apply)
                                  + partition = (known after apply)
                                  + readOnly  = (known after apply)
                                  + volumeID  = (known after apply)
                                }
                              + azureDisk             = {
                                  + cachingMode = (known after apply)
                                  + diskName    = (known after apply)
                                  + diskURI     = (known after apply)
                                  + fsType      = (known after apply)
                                  + kind        = (known after apply)
                                  + readOnly    = (known after apply)
                                }
                              + azureFile             = {
                                  + readOnly   = (known after apply)
                                  + secretName = (known after apply)
                                  + shareName  = (known after apply)
                                }
                              + cephfs                = {
                                  + monitors   = (known after apply)
                                  + path       = (known after apply)
                                  + readOnly   = (known after apply)
                                  + secretFile = (known after apply)
                                  + secretRef  = {
                                      + name = (known after apply)
                                    }
                                  + user       = (known after apply)
                                }
                              + cinder                = {
                                  + fsType    = (known after apply)
                                  + readOnly  = (known after apply)
                                  + secretRef = {
                                      + name = (known after apply)
                                    }
                                  + volumeID  = (known after apply)
                                }
                              + configMap             = {
                                  + defaultMode = (known after apply)
                                  + items       = (known after apply)
                                  + name        = (known after apply)
                                  + optional    = (known after apply)
                                }
                              + csi                   = {
                                  + driver               = (known after apply)
                                  + fsType               = (known after apply)
                                  + nodePublishSecretRef = {
                                      + name = (known after apply)
                                    }
                                  + readOnly             = (known after apply)
                                  + volumeAttributes     = (known after apply)
                                }
                              + downwardAPI           = {
                                  + defaultMode = (known after apply)
                                  + items       = (known after apply)
                                }
                              + emptyDir              = {
                                  + medium    = (known after apply)
                                  + sizeLimit = (known after apply)
                                }
                              + ephemeral             = {
                                  + volumeClaimTemplate = {
                                      + metadata = {
                                          + annotations                = (known after apply)
                                          + creationTimestamp          = (known after apply)
                                          + deletionGracePeriodSeconds = (known after apply)
                                          + deletionTimestamp          = (known after apply)
                                          + finalizers                 = (known after apply)
                                          + generateName               = (known after apply)
                                          + generation                 = (known after apply)
                                          + labels                     = (known after apply)
                                          + managedFields              = (known after apply)
                                          + name                       = (known after apply)
                                          + namespace                  = (known after apply)
                                          + ownerReferences            = (known after apply)
                                          + resourceVersion            = (known after apply)
                                          + selfLink                   = (known after apply)
                                          + uid                        = (known after apply)
                                        }
                                      + spec     = {
                                          + accessModes               = (known after apply)
                                          + dataSource                = {
                                              + apiGroup = (known after apply)
                                              + kind     = (known after apply)
                                              + name     = (known after apply)
                                            }
                                          + dataSourceRef             = {
                                              + apiGroup  = (known after apply)
                                              + kind      = (known after apply)
                                              + name      = (known after apply)
                                              + namespace = (known after apply)
                                            }
                                          + resources                 = {
                                              + limits   = (known after apply)
                                              + requests = (known after apply)
                                            }
                                          + selector                  = {
                                              + matchExpressions = (known after apply)
                                              + matchLabels      = (known after apply)
                                            }
                                          + storageClassName          = (known after apply)
                                          + volumeAttributesClassName = (known after apply)
                                          + volumeMode                = (known after apply)
                                          + volumeName                = (known after apply)
                                        }
                                    }
                                }
                              + fc                    = {
                                  + fsType     = (known after apply)
                                  + lun        = (known after apply)
                                  + readOnly   = (known after apply)
                                  + targetWWNs = (known after apply)
                                  + wwids      = (known after apply)
                                }
                              + flexVolume            = {
                                  + driver    = (known after apply)
                                  + fsType    = (known after apply)
                                  + options   = (known after apply)
                                  + readOnly  = (known after apply)
                                  + secretRef = {
                                      + name = (known after apply)
                                    }
                                }
                              + flocker               = {
                                  + datasetName = (known after apply)
                                  + datasetUUID = (known after apply)
                                }
                              + gcePersistentDisk     = {
                                  + fsType    = (known after apply)
                                  + partition = (known after apply)
                                  + pdName    = (known after apply)
                                  + readOnly  = (known after apply)
                                }
                              + gitRepo               = {
                                  + directory  = (known after apply)
                                  + repository = (known after apply)
                                  + revision   = (known after apply)
                                }
                              + glusterfs             = {
                                  + endpoints = (known after apply)
                                  + path      = (known after apply)
                                  + readOnly  = (known after apply)
                                }
                              + hostPath              = {
                                  + path = (known after apply)
                                  + type = (known after apply)
                                }
                              + image                 = {
                                  + pullPolicy = (known after apply)
                                  + reference  = (known after apply)
                                }
                              + iscsi                 = {
                                  + chapAuthDiscovery = (known after apply)
                                  + chapAuthSession   = (known after apply)
                                  + fsType            = (known after apply)
                                  + initiatorName     = (known after apply)
                                  + iqn               = (known after apply)
                                  + iscsiInterface    = (known after apply)
                                  + lun               = (known after apply)
                                  + portals           = (known after apply)
                                  + readOnly          = (known after apply)
                                  + secretRef         = {
                                      + name = (known after apply)
                                    }
                                  + targetPortal      = (known after apply)
                                }
                              + name                  = "argocd-secrets"
                              + nfs                   = {
                                  + path     = (known after apply)
                                  + readOnly = (known after apply)
                                  + server   = (known after apply)
                                }
                              + persistentVolumeClaim = {
                                  + claimName = (known after apply)
                                  + readOnly  = (known after apply)
                                }
                              + photonPersistentDisk  = {
                                  + fsType = (known after apply)
                                  + pdID   = (known after apply)
                                }
                              + portworxVolume        = {
                                  + fsType   = (known after apply)
                                  + readOnly = (known after apply)
                                  + volumeID = (known after apply)
                                }
                              + projected             = {
                                  + defaultMode = (known after apply)
                                  + sources     = (known after apply)
                                }
                              + quobyte               = {
                                  + group    = (known after apply)
                                  + readOnly = (known after apply)
                                  + registry = (known after apply)
                                  + tenant   = (known after apply)
                                  + user     = (known after apply)
                                  + volume   = (known after apply)
                                }
                              + rbd                   = {
                                  + fsType    = (known after apply)
                                  + image     = (known after apply)
                                  + keyring   = (known after apply)
                                  + monitors  = (known after apply)
                                  + pool      = (known after apply)
                                  + readOnly  = (known after apply)
                                  + secretRef = {
                                      + name = (known after apply)
                                    }
                                  + user      = (known after apply)
                                }
                              + scaleIO               = {
                                  + fsType           = (known after apply)
                                  + gateway          = (known after apply)
                                  + protectionDomain = (known after apply)
                                  + readOnly         = (known after apply)
                                  + secretRef        = {
                                      + name = (known after apply)
                                    }
                                  + sslEnabled       = (known after apply)
                                  + storageMode      = (known after apply)
                                  + storagePool      = (known after apply)
                                  + system           = (known after apply)
                                  + volumeName       = (known after apply)
                                }
                              + secret                = {
                                  + defaultMode = (known after apply)
                                  + items       = (known after apply)
                                  + optional    = (known after apply)
                                  + secretName  = "argocd-secrets"
                                }
                              + storageos             = {
                                  + fsType          = (known after apply)
                                  + readOnly        = (known after apply)
                                  + secretRef       = {
                                      + name = (known after apply)
                                    }
                                  + volumeName      = (known after apply)
                                  + volumeNamespace = (known after apply)
                                }
                              + vsphereVolume         = {
                                  + fsType            = (known after apply)
                                  + storagePolicyID   = (known after apply)
                                  + storagePolicyName = (known after apply)
                                  + volumePath        = (known after apply)
                                }
                            },
                        ]
                    }
                }
              + ttlSecondsAfterFinished = 3600
            }
        }

      + timeouts {
          + create = "5m"
          + delete = "2m"
          + update = "5m"
        }

      + wait {
          + fields = {
              + "status.succeeded" = "1"
            }
        }
    }

  # module.argocd.kubernetes_manifest.argocd_secret will be updated in-place
  ~ resource "kubernetes_manifest" "argocd_secret" {
      + computed_fields = [
          + "status",
        ]
        # (2 unchanged attributes hidden)

      + timeouts {
          + create = "5m"
          + delete = "2m"
          + update = "5m"
        }
    }

  # module.argocd.kubernetes_role.argocd_init_password will be created
  + resource "kubernetes_role" "argocd_init_password" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-init-password"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "secrets",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "patch",
              + "update",
            ]
        }
    }

  # module.argocd.kubernetes_role_binding.argocd_init_password will be created
  + resource "kubernetes_role_binding" "argocd_init_password" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-init-password"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "argocd-init-password"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "argocd-init-password"
          + namespace = "argocd"
        }
    }

  # module.argocd.kubernetes_service_account.argocd_init_password will be created
  + resource "kubernetes_service_account" "argocd_init_password" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-init-password"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cloud_sql.data.google_secret_manager_secret_version.ojeomneo_db_credentials will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "ojeomneo_db_credentials" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "infra-480802"
      + secret       = "prod-ojeomneo-db-credentials"
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.cloud_sql.data.google_secret_manager_secret_version.reviewmaps_db_credentials will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "reviewmaps_db_credentials" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "infra-480802"
      + secret       = "prod-reviewmaps-db-credentials"
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.cloud_sql.google_sql_user.ojeomneo will be updated in-place
  ~ resource "google_sql_user" "ojeomneo" {
        id                      = "ojeomneo//prod-woohalabs-cloudsql"
        name                    = (sensitive value)
      ~ password                = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.cloud_sql.google_sql_user.reviewmaps will be updated in-place
  ~ resource "google_sql_user" "reviewmaps" {
        id                      = "reviewmaps//prod-woohalabs-cloudsql"
        name                    = (sensitive value)
      ~ password                = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.cloud_sql.null_resource.enable_pgcrypto will be created
  + resource "null_resource" "enable_pgcrypto" {
      + id = (known after apply)
    }

  # module.cloud_sql.null_resource.enable_postgis will be created
  + resource "null_resource" "enable_postgis" {
      + id = (known after apply)
    }

  # module.cloud_sql.null_resource.ojeomneo_ownership will be created
  + resource "null_resource" "ojeomneo_ownership" {
      + id = (known after apply)
    }

  # module.cloud_sql.null_resource.reviewmaps_ownership will be created
  + resource "null_resource" "reviewmaps_ownership" {
      + id = (known after apply)
    }

  # module.gke.google_container_node_pool.spot_pool_large will be updated in-place
  ~ resource "google_container_node_pool" "spot_pool_large" {
        id                          = "projects/infra-480802/locations/asia-northeast3-a/clusters/woohalabs-prod-gke/nodePools/woohalabs-prod-spot-large"
        name                        = "woohalabs-prod-spot-large"
      ~ node_count                  = 0 -> 2
        # (9 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count       = 0 -> 4
          ~ min_node_count       = 0 -> 2
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.spot_pool_medium will be updated in-place
  ~ resource "google_container_node_pool" "spot_pool_medium" {
        id                          = "projects/infra-480802/locations/asia-northeast3-a/clusters/woohalabs-prod-gke/nodePools/woohalabs-prod-spot-medium"
        name                        = "woohalabs-prod-spot-medium"
      ~ node_count                  = 2 -> 0
        # (9 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count       = 2 -> 0
          ~ min_node_count       = 2 -> 0
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 8 to add, 5 to change, 0 to destroy.

```

</details>

---

**To apply this plan, comment:**
- `apply` or `ok` or `terraform apply`

*Pusher: @ggorockee, Action: `pull_request`, Workflow: `GCP Terraform Plan`*